@echo off
title 绑定IP
cls
color 0A

echo.
Echo *******************************************************************************
Echo *     当前网络配置
Echo *******************************************************************************
echo.

ipconfig

echo.
Echo *******************************************************************************
Echo *     请输入配置项
Echo *******************************************************************************
echo.

set mask=255.255.255.0

set /p name=请输入网卡名称：
set /p addr=请输入 IP 地址：
set /p mask=子网掩码(默认：%mask%)：
set /p gateway=请输入网关：

echo.
Echo *******************************************************************************
Echo *     正在配置，请耐心等待…………
Echo *******************************************************************************
echo.

cmd /c netsh interface ip set address name=%name%  ^
    source=static ^
    addr=%addr%  ^
    mask=%mask%  ^
    gateway=%gateway%  ^
    gwmetric=1
ipconfig /all

echo.
Echo *******************************************************************************
Echo *     OK！！已完成！请按任意键继续…………
Echo *******************************************************************************
echo.

Pause
